app/controllers/books_controller.rb

INSERT INTO "books" ("isbn", "name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["isbn", 34], ["name", "hello"], ["description", "hello desc"], ["created_at", "2022-06-24 17:31:43.391832"], ["updated_at", "2022-06-24 17:31:43.391832"]]
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "books"."id" = $4  [["name", "rails backend dev"], ["description", "this is your start for becoming a rails backend dev"], ["updated_at", "2022-06-24 17:37:02.482526"], ["id", 2]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 3]]
---
  def destroy
    @book = Book.find(params[:id])
    @book.destroy